tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap "homebrew/core"
tap 'homebrew/fuse'
tap 'homebrew/science'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'bramstein/webfonttools'
tap 'neovim/neovim'

tap 'argon/mas'
tap 'neovim/neovim'
tap 'ravenac95/sudolikeaboss'
tap 'vitorgalvao/tiny-scripts'
tap 'buo/cask-upgrade'

brew 'git'
brew 'git-flow'
brew 'git-extra'
brew 'gist'
brew 'diffstat'
brew 'diffutils'

brew 'aria2'
brew "ack"
brew 'argon/mas/mas'

brew "imagemagick"
brew 'pandoc'
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils'
brew 'moreutils'
brew 'gnupg2'
brew 'grep', args: ['with-default-names']
brew 'make', args: ['with-default-names']
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'screen'
brew 'nano'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew "imagemagick"
brew "jq"
brew "autoconf"
brew "automake"
brew "autossh"
brew "gcc"
brew 'cmake'
brew "go"
brew 'jpeg'
brew 'optipng'
brew 'redis'

brew "aws-cli"
brew "heroku-toolbelt"
brew "fig"
brew "freetype"

brew "lame"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "readline"
brew "libyaml"
brew "xz"

brew "p7zip"
brew "pigz"

brew "pipenv"
brew "python"
brew 'node'
brew "rbenv"
brew 'ruby'
brew "ruby-build"

brew "unrar"
brew "upx"
brew "wget"
brew "curl"
brew 'htop'
brew "nmap"
brew 'imagick'
brew 'stow'
brew 'cowsay'

brew "streamlink"
brew "tree"
brew 'autojump'
brew 'vim', args: ['override-system-vi']
brew 'neovim'
brew 'mc'
brew 'colorls'
brew 'exa'
brew 'npm'
brew 'openssl'
brew 'httpie'
brew 'yarn'
brew 'watchman'
brew 'qt'
brew 'pcre'
brew 'passenger'
brew 'peco'
brew 'fzf'
brew 'findutils'
brew 'z'
brew 'highlight'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'

brew 'mysql'
brew 'postgresql'
brew 'sqlite3'

cask 'osxfuse'
cask 'xquartz'
cask "kitematic"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "sip"

cask 'postgres'

cask 'aerial'
cask 'alfred'
cask "dictionaries"
cask "bartender"
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'asepsis'
cask 'gpg-suite'
cask 'insomnia'
cask 'adobe-reader'

brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

cask 'now'
cask 'framer'
cask 'nucleo'
cask 'figma'
cask 'steam'
cask 'teamviewer'

cask 'java'
cask 'sequel-pro'
cask 'tableplus'

cask 'macdown'
cask 'notion'
cask 'boostnote'

cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'opera'
cask 'tor-browser'

cask 'tunnelbear'
cask 'transmission'

cask 'skype'
cask 'zoomus'
cask 'telegram'
cask 'telegram-desktop'
cask 'gitter'

cask "vlc"
cask 'handbrake'

cask 'hazel'
cask 'focus'
cask 'spectacle'
cask "bettertouchtool"
cask "mtmr"
cask 'istat-menus'
cask 'spotify'
cask 'soundcleod'

cask 'dropbox'
cask 'google-drive-file-stream'
cask 'google-photos-backup-and-sync'

cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'genymotion'

cask 'monodraw'
cask 'moom'

cask 'tower2'
cask 'sourcetree'
cask "iterm2"
cask 'hyper'
cask 'visual-studio-code'
cask 'visual-studio-code-insider'

cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzipql"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"

cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask "font-meslo-nerd-font"
cask "font-fira-code"

cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

