franciscolourenco/done
matchai/spacefish
jorgebucaran/fish-getopts
jethrokuan/z
jorgebucaran/fish-spark
rodrigobdz/fish-apple-touchbar
danhper/fish-ssh-agent
edc/bass
jorgebucaran/fish-bax
jethrokuan/fzf
laughedelic/pisces
oh-my-fish/plugin-bang-bang
brigand/fast-nvm-fish
FabioAntunes/fish-nvm
